---
kind: property
id: P:Autodesk.Revit.DB.TableData.Width
zh: 宽度
source: html/2501ac82-ebc3-10e6-1740-29ef3c81d3ed.htm
---
# Autodesk.Revit.DB.TableData.Width Property

**中文**: 宽度

Gets or sets the table width in feet

## Syntax (C#)
```csharp
public double Width { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The table width is outside of the acceptable range.